Revit 2027 API
BuiltInFailures.GeneralFailures.UnspecifiedError Property
 Revit has experienced an unexpected error. The operation has been cancelled to protect your project from corruption.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnspecifiedError { get; }
Public Shared ReadOnly Property UnspecifiedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnspecifiedError {
	FailureDefinitionId^ get ();
}
static member UnspecifiedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace